app/views/posts/_postdetails.html.erb

    <p><%= truncate(post.text, length: 100, separator: ' ', omission: '...') %><p>
    <p class="tes">comments: <%= post.comments.length %>; likes: <%= post.likes.length %><p>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 29]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 9]]