app/views/posts/index.html.erb

       <div class='com'>
        <% e.recent_comments.each do |single|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]