app/views/posts/show.html.erb

    <h3>post #<%= @post.id %> by <%= @post.user.name %></h3>
    <p>comments: <%=@post.comments.length%>; likes: <%=@post.likes.length%></p>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 29]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 29]]