app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @comment = Comment.new
    @post = Post.find(params[:post_id])
    @user = User.find(params[:user_id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("created_at", "updated_at", "author_id", "post_id", "text") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2023-05-10 16:43:43.645874"], ["updated_at", "2023-05-10 16:43:43.645874"], ["author_id", 1], ["post_id", 3], ["text", "we cool my gee"]]
---
  def create
    @post = Post.find(params[:post_id])
    @user = User.find(params[:user_id])
    @comment = Comment.new(
      author_id: current_user.id,
      post_id: params[:post_id],
      text: params[:comment][:comment]
    )
    return unless @comment.save