app/controllers/likes_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "likes" ("post_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 5], ["author_id", 1], ["created_at", "2023-05-10 20:48:58.813057"], ["updated_at", "2023-05-10 20:48:58.813057"]]
---
  def create
    @user = User.find(params[:user_id])
    @post = Post.find(params[:post_id])
    @like = Like.new(post_id: @post.id, author_id: current_user.id)
    return unless @like.save