app/controllers/posts_controller.rb

  def index
    @user = User.find(params[:user_id])
    @posts = Post.includes(:user, :comments, :likes).where(author_id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4)  [["post_id", 1], ["post_id", 2], ["post_id", 3], ["post_id", 4]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN ($1, $2, $3, $4)  [["post_id", 1], ["post_id", 2], ["post_id", 3], ["post_id", 4]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 2]]

  def show
    @post = Post.includes(:user).find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.comment_counter = 0
    @post.likes_counter = 0
    return unless @post.save
---
INSERT INTO "posts" ("author_id", "title", "text", "comment_counter", "likes_counter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"