app/models/comment.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
UPDATE "posts" SET "comment_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comment_counter", 8], ["updated_at", "2023-05-10 16:29:58.059541"], ["id", 1]]
---
  def update_comment_counter
    post.update(comment_counter: post.comments.length)