app/models/like.rb

  def update_likes_counter
    post.update(likes_counter: post.likes.length)
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 5]]
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2023-05-10 20:48:58.837890"], ["id", 5]]