app/models/post.rb

UPDATE "users" SET "updated_at" = $1, "posts_counter" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-05-10 15:17:19.535409"], ["posts_counter", 6], ["id", 1]]
---
  def update_posts_counter
    user.update(posts_counter: user.posts.length)